tutorials/addSpecificBCs-heater_testing/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 470;

boundaryField
{
    // floor
    // {
    // type fixedValue;
    // value uniform 440;
    // }
    floor
    	{
        type breadOvenHeater;
        refValue        uniform 470;
        refGradient     uniform 0;
        valueFraction   uniform 0;
        value           uniform 470;
        q_
            {
                type table;

                values
                (
                    (0       10)
                    (1000      25)
                    (2000      50)
                    (3000      75)
                    (4000      100)
                    (5000      300)
                    (6000      500)
                    (7000      750)
                    (8000      1000)
                );
            }
        TStop_          1000;
        TStart_         300;
        }
    	// {
        // type breadOvenSides;
        // refValue        uniform 600;
        // refGradient     uniform 0;
        // valueFraction   uniform 0;
        // value           uniform 600;
        // alpha_          0.6;
        // }
    ceiling
    	{
        type breadOvenSides;
        refValue        uniform 470;
        refGradient     uniform 0;
        valueFraction   uniform 0;
        value           uniform 470;
        alpha_          0.6;
        }
        // {
        // type fixedValue;
        // value uniform 300;
        // }
    front
    	{
        type breadOvenSides;
        refValue        uniform 470;
        refGradient     uniform 0;
        valueFraction   uniform 0;
        value           uniform 470;
        alpha_          0.6;
        }
        // {
        // type fixedValue;
        // value uniform 300;
        // }
    left
    	{
        type breadOvenSides;
        refValue        uniform 470;
        refGradient     uniform 0;
        valueFraction   uniform 0;
        value           uniform 470;
        alpha_          0.6;
        }
        // {
        // type fixedValue;
        // value uniform 300;
        // }
    back
    	{
        type breadOvenSides;
        refValue        uniform 470;
        refGradient     uniform 0;
        valueFraction   uniform 0;
        value           uniform 470;
        alpha_          0.6;
        }
        // {
        // type fixedValue;
        // value uniform 300;
        // }
    right
    	{
        type breadOvenSides;
        refValue        uniform 470;
        refGradient     uniform 0;
        valueFraction   uniform 0;
        value           uniform 470;
        alpha_          0.6;
        }
        // {
        // type fixedValue;
        // value uniform 300;
        // }
    hole
    {
        type            fixedValue;
        value           uniform 470;
    }

    // outlet
    // {
    //     type            zeroGradient;
    // }
}


// ************************************************************************* //
