tutorials/addSpecificBCs-heater_testing/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     buoyantSimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         10000;

deltaT          1;

writeControl    timeStep;

writeInterval   100;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable false;

functions
{
    solverInfo
    {
        type            solverInfo;
        libs            ("libutilityFunctionObjects.so");

        fields
        (
            U
            p_rgh
            T
            // k
            // omega
        );

        writeResidualFields yes;
        writeControl    timeStep;
        writeInterval   100;
    }
}
libs
(
    // "libsolids4FoamModels.so"
    "libbreadMixedBCsKuba.so"
    
);


// ************************************************************************* //
